OF_Sims/SIMPLE/Simple_RANS_cylinder/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    down
    {
        type            symmetryPlane;
        inGroups        List<word> 1(symmetryPlane);
        nFaces          220;
        startFace       13330;
    }
    right
    {
        type            patch;
        nFaces          30;
        startFace       13550;
    }
    up
    {
        type            patch;
        inGroups        List<word> 1(patch);
        nFaces          220;
        startFace       13580;
    }
    left
    {
        type            patch;
        nFaces          30;
        startFace       13800;
    }
    cylinder
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          40;
        startFace       13830;
    }
    defaultFaces
    {
        type            empty;
        inGroups        List<word> 1(empty);
        nFaces          13600;
        startFace       13870;
    }
)

// ************************************************************************* //
